Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/older_and_retired_people/early_retirement.html.txt.tmx
Source language: en
Languages: ga

source: Early retirement usually means retirement before the age of 65
ga: Ciallaíonn 'ag dul amach ar pinsean luath', má théann tú amach ar pinsean roimh 65 bliain d'aois

source: Early retirement may happen because you have to retire from your job at a certain age, because you choose to take early retirement or because you have been let go
ga: B'fhéidir go dtarlódh seo de bharr: go bhfuil aois sainordaithe dul amach ar pinsean san fhostaíocht ina bhfuil tú, gur roghnaigh tú féin dul amach ar pinsean luath nó b'fhéidir gur scaoileadh leat

source: Sometimes people who are described as taking early retirement have actually been made redundant
ga: Anois agus arís déantar cur síos ar raidhsiúlacht mar 'dul amach ar pinsean luath'

source: Others who have been obliged to take early retirement may regard themselves as unemployed and there are special provisions for older jobseekers
ga: Tá daoine ann agus sé an dearcadh atá acu ná go bhfuil siad dífhostaithe de bharr gur cuireadh iachall orthu dul amach ar pinsean luath

source: This document outlines your entitlements to social welfare benefits if you retire early and what arrangements you should make to keep your entitlement to a state pension
ga: Sa doiciméad seo déantar cur síos ar do chuid cearta ó thaobh Liúntas Leasa Shóisialaigh, má théann tú amach ar pinsean luath agus na socraithe cuí ar cheart a dhéanamh le cinntiú go mbeidh tú i dteideal an pinsean seanaoise

source: If you are made redundant, you may get a statutory redundancy lump sum
ga: Má scaoiltear leat de bharr raidhsiúlacht, b'fhéidir go mbeidh tú i dteideal cnapshuim raidhsiúlachta reachtúla

source: If you retire early, for whatever reason, you may be entitled to Jobseeker's Benefit and later to Jobseeker's Allowance
ga: Má théann tú amach ar pinsean luath, is cuma cén chúis atá taobh thiar de, tá tú i dteideal Sochar Cuardaitheora Poist agus ar ndóigh iad seo a leanas: Liúntas Cuardaitheora Poist

source: You may also be eligible for a range of back to work and back to education schemes
ga: Seans go mbeidh tú i dteideal réimse scéimeanna ar nós an Scéim filleadh ar obair agus an Scéim filleadh ar Oideachas

source: If you do retire early you should organise to continue your PRSI contributions so that your entitlement to an State Pension (Contributory) is maintained (see 'Credits' below)
ga: Má théann tú amach ar pinsean luath, is cuma cén chúis atá taobh thiar de, déan cinnte de go gcoinníonn tú suas chun dáta le do chuid íocaíochta ÁSPC sa chaoi is go mbeidh tú i dteideal an Pinsean Seanaoise Cúntach

source: If you are made redundant
ga: Má tá an fostaitheoir a bhí agat neamhachmhainne

source: The statutory (that means laid down by law) lump sum is the minimum sum that you must get
ga: B'fhéidir go bhfaighfeá íocaíocht ón gCiste Raidhsiúlachta Fostaíochta Neamhachmhainne

source: A higher payment may of course be negotiated with your employer, either by you or by your union
ga: Má tá d'fhostaitheoir i bhfiacha leat de bharr pá, airgead saoire, pá de bharr nár tugadh do dhóthain fógra duit agus a lán rudaí eile

source: You can get more information about redundancy on our website
ga: Seo é an chaoi a n-oibríonn an córas, is cuma cén aois atá tú

source: You may then be eligible for Jobseeker's Allowance (JA)
ga: Déan iarratas chuig an Roinn Fiontraíochta Trádála agus Fostaíochta

source: If you are claiming JA or JB and you are 62 or over you are not required to engage with the activation process and you will not be subject to penalty rates for non-engagement
ga: Is Cuma má tá tú dífhostaithe nó raidhsiúil, b'fhéidir go bhfuil tú i dteideal Sochar Cuardaitheora Poist (SCP) a fhad agus atá tú faoi 66 bliain d'aois

source: You can voluntarily avail of a range of supports (for example, training or employment support programmes) from the Department of Social Protection
ga: Ina dhiaidh sin b'fhéidir go mbeidh tú i dteideal Liúntas Cuardaitheora Poist (LCP) nó Liúntas roimh dhul amach ar pinsean

source: To qualify for Jobseeker's Benefit (JB), you must, among other things, be unemployed, aged under 66, capable of work, available for work and genuinely seeking work
ga: Caithfidh tú a bheith in ann dul ag obair, ar fáil le haghaidh oibre agus go bhfuil tú dairíre ag lorg oibre

source: If you have left work voluntarily, for example, if you have chosen early retirement, you may not get JB for 9 weeks after leaving work
ga: Más rud é gur fhág tú do phost go deonach, mar shampla, dá mba rud é go ndeachaigh tú amach ar pinsean luath, b'fhéidir nach mbeidh tú i dteideal SCP go ceann 9 seachtainí

source: After that, you may have a problem proving that you are available for and genuinely seeking work
ga: B'fhéidir go mbeidh fadhb agat freisin ina dhiaidh sin cruthú go bhfuil tú dáiríre ar fáil agus ag lorg oibre

source: If you are aged under 55 and you have received a redundancy payment of more than €50,000, you may be disqualified from JB for 9 weeks
ga: B'fhéidir nach mbeidh tú i dteideal JB go ceann 9 seachtainí, más rud é go bhfuil tú faoi bhun 55 bliain d'aois agus go bhfuair tú íocaíocht raidhsiúlachta níos mó ná €50,000

source: You can do a certain amount of work and continue to get some Jobseeker's Benefit
ga: Is féidir leat méid áirithe obair a dhéanamh agus fós a bheith i dteideal Sochar Cuardaitheora Poist

source: You should check with the Department of Social Protection before taking up work to see exactly what the effect will be
ga: Sula dtosaíonn tú ag obair téigh i dteagmháil leis an Roinn Coimirce Sóisialaí le eolas a fháil ar cén tionchur a bheidh aige ort

source: As a general rule, JB is payable for either 9 months or 6 months
ga: Tá SCP iníoctha do thréimhse 9 nó 12 mhí mar rial gineáralta

source: However, if you are aged between 65 and 66 when your JB would normally end, you may continue to receive it until the age of 66, provided you meet the PRSI requirements
ga: Ach mar sin féin, má tá tú idir 65 agus 66 bliain d'aois agus de ghnáth críochnaíonn íocaíochtaí UB, b'fhéidir go bhfaighfeá íocaíochtaí a fhad agus a chomhlíonann tú na riachtanais ÁSPC

source: If you have used up your entitlement to JB or you are not entitled to JB because you do not have enough PRSI contributions, you can apply for Jobseeker's Allowance (JA) if you are under 66
ga: Is féidir leat iarratas a dhéanamh ar Liúntas Cuardaitheora Poist (LCP), má tá do chuid íocaíochtaí ar SCP úsaidte suas agat agus má tá tú faoi bhun 66 bliain d'aois nó muna bhfuil SCP ag gabhail duit de bharr nach bhfuil Cabharthach ÁSPC agat

source: You must, among other things, be unemployed, be capable of, available for and actively seeking work and pass a means test
ga: Caithfidh tú a bheith dífhostaithe, a bheith in ann d'obair, a bheith ar fáil lena haghaidh agus a bheith ag lorg oibre

source: In general, if you have a reasonable level of pension from a former employer, you are unlikely to qualify for JA
ga: Go ginearalta, níl móran seans ann go mbeidh tú i dteideal UA má tá tú ag fáil pinsean réasúnta ó iar-fhostóir

source: If you have been getting an unemployment payment for some time, you may be eligible for the Back to Education Allowance
ga: B'fhéidir go mbeidh tú i dteideal ceann de na scéimeanna filleadh ar oideachas, má tá tú ag fáil íocaíochtaí dífhostaíochta le tamall anuas

source: If you retire early and do nothing, you will have a number of years during which you have no PRSI contributions
ga: Má théann tú amach ar pinsean luath agus tú díomhain, beidh cúpla bliain agat gan Cabharthach ÁSPC

source: This will mean that you may have difficulty in qualifying for the State Pension (Contributory)
ga: Da bharr seo, beidh deacrachtaí agat a chruthú go bhfuil tú i dteideal Pinsin Rann-íocaíochta Seanaoise

source: If you are not employed or self-employed, you do not have to pay PRSI contributions. You can keep your PRSI contribution record up to date either by getting credits or paying voluntary PRSI contributions
ga: Má tá tú dífhostaithe nó féinfhostaithe, ní chaithfidh tú Cabharthach ÁSPC a thabhairt suas go dáta nuair a fhaigheann tú creidmheasa nó má íocann tú go deonach as Cabharthach ÁSPC

source: You get social insurance credits while getting Jobseeker's Benefit and Jobseeker's Allowance
ga: Faigheann tú creidmheasa árachais shóisialaigh nuair atá tú ag fáil Sochar Cuardaitheora Poist

source: So, if you are getting one of these benefits up to age 65 or 66, you do not need to do anything else to maintain your social insurance record
ga: Má tá tú ag fáil aon cheann de na Liúntas suas go dtí 65-66 bliain d'aois, níl aon rud eile uait chun do chuntas árachas shóisialaigh a choiméad

source: If you do not qualify for Jobseeker's Allowance because you do not pass the means test, you can sign on for credits
ga: Is féidir leat síniú do chreimheasa muna bhfuil tú i dteideal Liúntas Cuardaitheora Poist de bharr gur theip ort sa bhfiosrú maoine

source: Usually, you are allowed sign on once a month
ga: Go hiondúil, síníonn tú uair sa mhí

source: If you do not qualify for Jobseeker's Benefit or Jobseeker's Allowance because you are considered to be unavailable for work, you may not be able to sign on for credits either
ga: Muna bhfuil tú i dteideal Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist de bharr go bhfuil sé ráite nach bhfuil tú ar fáil d'obair, b'fhéidir nach mbeidh tú in ann síniú do chreidmheasa ach an oiread

source: If this is the case or if, for example, you want to spend all or part of your retirement abroad, you can become a voluntary contributor to social insurance
ga: Más seo é an cás nó mar shampla, go bhfuil tú ag iarraidh dul amach ar pinsean thar lear go fadthéarmach nó achar ghairid, is féidir leat a bheith i do ranníocóir dheonach don árachas shóisialaigh

source: You should apply to the Department of Social Protection to become a voluntary contributor within a year of retirement
ga: Ba cheart duit iarratas a dhéanamh chuig an Roinn Coimirce Sóisialaí mar ranníocóir dheonach lastuigh de bhliain i ndiaidh duit dul amach ar pinsean
